app/Http/Controllers/API/EventController.php

select * from `events` where `events`.`deleted_at` is null
select exists(select * from `attendences` where `event_id` = 1 and `user_id` = '1') as `exists`
---
    public function index($userId = null)
    {
        $events = Event::all();
        $eventsWithAttendance = [];

        foreach ($events as $event) {
            $attendanceRequest = $userId ? Attendence::where('event_id', $event->id)
                ->where('user_id', $userId)
                ->exists() : false;

select * from `events` where `events`.`id` = '2' and `events`.`deleted_at` is null limit 1
---
    public function attended(string $userId)
    {
        // Query events associated with the specified user and where 'type' is 'Event'
        $events = Event::whereHas('attendedEvents', function ($query) use ($userId) {
            $query->where('user_id', $userId)->where('type', 'Event');
        })->get();