routes/web.php

    Route::get('invoices/items', [InvoicesController::class, 'items']);
    Route::get('leads/{id}/show_convert', [LeadsController::class, 'showConvertToDeal']);

    Route::get('audit-trail', function () {
        $activityLogs = \Spatie\Activitylog\Models\Activity::all();

        return view('admin.audit.index', compact('activityLogs'));
    });
---
select * from `activity_log`