app/Http/Controllers/CommunicationsController.php

select * from `newsletters`
---
    public function newsletter_view()
    {
        $communications = \App\Models\Newsletter::all();