app/Http/Controllers/DashboardController.php

select * from `invoices` order by `id` desc limit 5
select count(*) as aggregate from `invoices`
select count(*) as aggregate from `users` where `user_type` = 'Member' and `users`.`deleted_at` is null
select count(*) as aggregate from `cpds` where `cpds`.`deleted_at` is null
select count(*) as aggregate from `events` where `events`.`deleted_at` is null
---
    public function index()
    {
        if (Auth::user()->user_type == "Admin") {
            $account_types = AccountType::withCount('users')->get();

            $users_chart_series = "[";
            $users_chart_labels = "[";

            foreach ($account_types as $account_type) {
                $users_chart_series .= $account_type->users_count.',';
                $users_chart_labels .= '"'.$account_type->name.'",';
            }

            $invoices = \App\Models\Invoice::take(5)->orderBy('id','desc')->get();

            $invoices_count = \App\Models\Invoice::count();
            $members_count = \App\Models\User::where('user_type','Member')->count();
            $cpds_count = \App\Models\Cpd::count();
            $events_count = \App\Models\Event::count();

select * from `users` where `users`.`id` = '1981' and `users`.`deleted_at` is null limit 1
select * from `payments` where `user_id` = '1981' and `type` = 'Subscription' order by `id` desc limit 1
---
    public function review($id)
    {
        $member = \App\Models\User::find($id);
        $payment = $member->account_type->rate;

        $last_subcription = \App\Models\Payment::where('user_id',$id)
                            ->where('type','Subscription')
                            ->orderBy('id','desc')
                            ->first();

select * from `users` where `users`.`id` = '1981' and `users`.`deleted_at` is null limit 1
select * from `payments` where `user_id` = 1981 and `type` = 'Subscription' order by `id` desc limit 1
---
    public function post_review(Request $request)
    {
        // try{
            if ($request->status == "Denied") {
                $request->validate([
                    'comment' => 'required'
                ]);
            }

            \DB::beginTransaction();

            $member = User::find($request->member);
            $membership = $member->latestMembership;

            if ($request->status == "Approved") {
                $last_subcription = \App\Models\Payment::where('user_id',$member->id)
                        ->where('type','Subscription')
                        ->orderBy('id','desc')
                        ->first();

insert into `payments` (`type`, `amount`, `balance`, `user_id`, `received_by`, `membership_id`, `updated_at`, `created_at`) values ('Subscription', '500', 0, 1981, 2, 330, '2024-10-15 09:51:09', '2024-10-15 09:51:09')
---
                $payment->user_id = $member->id;
                $payment->received_by = \Auth::user()->id;
                $payment->membership_id = $membership->id;
                $payment->save();

select * from `cpds` where `cpds`.`deleted_at` is null
select * from `events` where `events`.`deleted_at` is null
---
    public function create_reminder($type)
    {
        $cpds = [];
        $events = [];
        if ($type == 'cpd') {
            $cpds = Cpd::all();
        }else{
            $events = Event::all();