app/Http/Controllers/EventsController.php

    public function direct_attendence($type, $id)
    {
        $data = new \stdClass;
        $data->type = $type;
        $data->id = $id;

        if ($type == "cpd") {
            $cpd = \App\Models\Cpd::find($id);
            $data->name = $cpd->topic;
            $data->points = $cpd->points;
            $data->end_date = $cpd->end_date;
            $data->banner = $cpd->banner;
            $data->code = $cpd->code;
        }

        if ($type == "event") {
            $event = Event::find($id);
---
select * from `events` where `events`.`id` = '34' and `events`.`deleted_at` is null limit 1