app/Http/Controllers/RemindersController.php

    public function index(Request $request)
    {
        try{
            $reminders = MemberReminder::query();

            if ($request->status) {
                $reminders->where('status',$request->status);
            }

            $reminders = $reminders->orderBy('id','desc')->get();
---
select * from `member_reminders` where `status` = 'unread' order by `id` desc