app/Http/Controllers/UsersController.php

    public function edit($user){
        $user = User::find($user);
---
select * from `users` where `users`.`id` = '1' and `users`.`deleted_at` is null limit 1