app/Models/Customer.php

    public function customerInvoice($customerId)
    {
        $invoices  = Invoice:: where('customer_id', $customerId)->orderBy('issue_date', 'desc')->get();
        $proposals = Proposal:: where('customer_id', $customerId)->orderBy('issue_date', 'desc')->get()->toArray();
---
select * from `invoices` where `customer_id` = 4 order by `issue_date` desc
select * from `proposals` where `customer_id` = 4 order by `issue_date` desc

    public function customerProposal($customerId)
    {
        $proposals = Proposal:: where('customer_id', $customerId)->orderBy('issue_date', 'desc')->get();
---
select * from `proposals` where `customer_id` = 4 order by `issue_date` desc

    public function customerOverdue($customerId)
    {
        $dueInvoices = Invoice:: where('customer_id', $customerId)->whereNotIn(
            'status', [
                        '0',
                        '4',
                    ]
        )->where('due_date', '<', date('Y-m-d'))->get();
---
select * from `invoices` where `customer_id` = 4 and `status` not in ('0', '4') and `due_date` < '2024-10-15'

    public function customerTotalInvoiceSum($customerId)
    {
        $invoices = Invoice:: where('customer_id', $customerId)->get();
---
select * from `invoices` where `customer_id` = 4

    public function customerTotalInvoice($customerId)
    {
        $invoices = Invoice:: where('customer_id', $customerId)->count();
---
select count(*) as aggregate from `invoices` where `customer_id` = 4