app/Models/Event.php

    public function sendNotification()
    {
        //get the user with id 1
        $devices = UserFcmDeviceToken::all();
---
select * from `user_fcm_device_tokens`