app/Models/Proposal.php

    public function getTotalTax()
    {
        $totalTax = 0;
        foreach($this->items as $product)
        {
            // $taxes = Utility::totalTaxRate();
            $taxArr  = explode(',', $product->tax);
            $taxRate = 0;

            foreach($taxArr as $tax)
            {

                $tax     = Tax::find($tax);
---
select * from `taxes` where `taxes`.`id` = '1' limit 1