app/Http/Controllers/Admin/AccountTypesController.php

select * from `account_types` limit 10 offset 0
select count(*) as aggregate from `account_types`
---
    public function index(Request $request, ) {

        $accountTypes = AccountType::query();

        if(!empty($request->search)) {
            $accountTypes->where('name', 'like', '%' . $request->search . '%');
        }

        $accountTypes = $accountTypes->paginate(10);