app/Http/Controllers/Admin/CpdsController.php

    public function index(Request $request, )
    {

        $cpds = Cpd::query();
        //dd($cpds);

        if (!empty($request->search)) {
            //dd("here in search");
            $cpds->where('code', 'like', '%' . $request->search . '%');
        }

        $cpds = $cpds->get();
---
select * from `cpds` where `cpds`.`deleted_at` is null