app/Http/Controllers/Admin/CustomersController.php

select * from `customers`
---
     public function index()
    {
        // if(\Auth::user()->can('manage customer'))
        // {
            $customers = Customer::all();

select * from `customers` where `customers`.`id` = 4 limit 1
---
    public function show($ids)
    {
        $id       = \Crypt::decrypt($ids);
        $customer = Customer::find($id);