app/Http/Controllers/Admin/EventsController.php

select * from `events` where `events`.`deleted_at` is null
---
    public function index(Request $request, ) {

        $events = Event::query();

        if(!empty($request->search)) {
            $events->where('name', 'like', '%' . $request->search . '%');
        }

        $events = $events->get();