app/Http/Controllers/Admin/FormBuildersController.php

select * from `form_builders`
---
    public function index()
    {
        $usr = Auth::user();
        $forms = FormBuilder::get();

select * from `form_builders` where `form_builders`.`id` = '10' limit 1
---
    public function fieldStore($id, Request $request)
    {
        $usr = \Auth::user();
        // if($usr->can('create form field'))
        // {
        \DB::beginTransaction();
        $formbuilder = FormBuilder::find($id);