app/Http/Controllers/Admin/MembersController.php

select * from `users` where `user_type` = 'Member' and `users`.`deleted_at` is null
select * from `account_types`
---
    public function index()
    {
        $members = User::where('user_type','Member')->get();

        $account_types = \App\Models\AccountType::all();

select * from `users` where `users`.`id` = '1345' and `users`.`deleted_at` is null limit 1
---
    public function show($id)
    {
        $member = User::find($id);