app/Jobs/SendNewsletter.php

    public function handle(): void
    {
        // Get all verified users
        $users = User::whereNotNull('email_verified_at')->get();
---
select * from `users` where `email_verified_at` is not null and `users`.`deleted_at` is null